name: "qwen3_embedder"
backend: "python"
max_batch_size: 64

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

output [
  {
    name: "EMBEDDING"
    data_type: TYPE_FP32
    dims: [ 1024 ]
  }
]
